这`MEMORY USAGE`命令报告密钥的字节数及其值
需要存储在内存中。

报告的使用情况是数据和
键其值所需的管理开销。

对于嵌套数据类型，可选`SAMPLES`可以提供选项，其中
`count`是采样嵌套值的数量。默认情况下，此选项已设置
自`5`.要对所有嵌套值进行采样，请使用`SAMPLES 0`.

@examples

使用 Redis v4.0.1 64 位和**杰马洛克**，则空字符串的度量如下所示：

    > SET "" ""
    OK
    > MEMORY USAGE ""
    (integer) 51

这些字节目前是纯粹的开销，因为没有存储实际数据，并且
用于维护服务器的内部数据结构。较长的按键和
值显示渐近线性用法。

    > SET foo bar
    OK
    > MEMORY USAGE foo
    (integer) 54
    > SET cento 01234567890123456789012345678901234567890123
    45678901234567890123456789012345678901234567890123456789
    OK
    127.0.0.1:6379> MEMORY USAGE cento
    (integer) 153

@return

@integer回复：内存使用情况（以字节为单位），或`nil`当密钥不存在时。
