该命令返回与给定 ID 范围匹配的流条目。
该范围由最小和最大 ID 指定。所有条目都有
两个指定 ID 之间的 ID 或恰好是指定两个 ID 中的一个
（闭合间隔）返回。

这`XRANGE`命令有许多应用程序：

*   在特定时间范围内返回项目。这是可能的，因为
    流 ID 为[与时间相关](/topics/streams-intro).
*   以增量方式迭代流，仅返回
    每次迭代时都有几个项目。然而，它在语义上要多得多
    比`SCAN`功能系列。
*   从流中获取单个条目，提供条目的 ID
    获取两次：作为查询间隔的开始和结束。

该命令还具有一个倒数命令，返回
反向顺序，称为`XREVRANGE`，否则完全相同。

## `-`和`+`特殊身份证件

这`-`和`+`特殊 ID 分别表示可能的最低 ID
和流中可能的最大 ID，因此使用以下命令
将只返回流中的每个条目：

    > XRANGE somestream - +
    1) 1) 1526985054069-0
       2) 1) "duration"
          2) "72"
          3) "event-id"
          4) "9"
          5) "user-id"
          6) "839248"
    2) 1) 1526985069902-0
       2) 1) "duration"
          2) "415"
          3) "event-id"
          4) "2"
          5) "user-id"
          6) "772213"
    ... other entries here ...

这`-`ID 实际上与指定完全相同`0-0`而
`+`等效于`18446744073709551615-18446744073709551615`然而
他们更适合打字。

## 不完整的身份证件

流 ID 由两部分组成：Unix 毫秒时间戳和
在同一毫秒内插入的条目的序列号。这是可能的
使用`XRANGE`仅指定 ID 的第一部分，即毫秒时间，
如以下示例所示：

    > XRANGE somestream 1526985054069 1526985055069

在这种情况下，`XRANGE`将自动完成启动间隔`-0`
和结束间隔`-18446744073709551615`，以便返回所有
在给定毫秒和结束之间生成的条目
其他指定的毫秒。这也意味着重复相同的
毫秒两次，我们在这样的毫秒内得到所有条目，
因为序列号范围将从零到最大值。

以这种方式使用`XRANGE`用作范围查询命令来获取条目
在指定时间内。这非常方便，以便访问历史记录
流中过去的事件。

## 独家系列

默认情况下，范围接近（包括），这意味着回复可以包括
ID 与查询的开始和结束间隔匹配的条目。这是可能的
指定打开间隔（独占），方法是在 ID 前面加上
字符`(`.这对于迭代流非常有用，如下所述。

## 返回最大条目数

使用**计数**选项 可以减少条目数
报道。这是一个非常重要的特征，即使它看起来很边缘，
因为它允许，例如，对操作进行建模，例如*给我
大于或等于以下内容的条目*:

    > XRANGE somestream 1526985054069-0 + COUNT 1
    1) 1) 1526985054069-0
       2) 1) "duration"
          2) "72"
          3) "event-id"
          4) "9"
          5) "user-id"
          6) "839248"

在上面的情况下，条目`1526985054069-0`存在，否则服务器
会给我们下一个。用`COUNT`也是基础，以便
用`XRANGE`作为迭代器。

## 迭代流

为了迭代流，我们可以按以下步骤操作。让我们假设
我们每次迭代需要两个元素。我们开始获取前两个
元素，这是微不足道的：

    > XRANGE writers - + COUNT 2
    1) 1) 1526985676425-0
       2) 1) "name"
          2) "Virginia"
          3) "surname"
          4) "Woolf"
    2) 1) 1526985685298-0
       2) 1) "name"
          2) "Jane"
          3) "surname"
          4) "Austen"

然后，而不是从`-`，作为开始
的范围内，我们使用的条目 ID*最后*返回的条目
以前`XRANGE`作为独占间隔调用。

最后一个条目的 ID 为`1526985685298-0`，所以我们只是前缀
使用'（'，然后继续我们的迭代：

    > XRANGE writers (1526985685298-0 + COUNT 2
    1) 1) 1526985691746-0
       2) 1) "name"
          2) "Toni"
          3) "surname"
          4) "Morrison"
    2) 1) 1526985712947-0
       2) 1) "name"
          2) "Agatha"
          3) "surname"
          4) "Christie"

等等。最终，这将允许访问中的所有条目
流。显然，我们可以从任何ID开始迭代，甚至可以从
特定时间，通过提供给定的不完整的启动 ID。此外，我们
可以通过提供结束将迭代限制为给定的 ID 或时间
ID 或不完整的 ID，而不是`+`.

命令`XREAD`还能够迭代流。
命令`XREVRANGE`可以从较高的 ID 反向迭代流
（或时间）以降低 ID（或时间）。

### 使用早期版本的 Redis 进行迭代

虽然独占范围间隔仅在 Redis 6.2 中可用，但它仍然是
可以在早期版本中使用类似的流迭代模式。你
以与上述相同的方式从流中开始获取，以获取
第一个条目。

对于后续调用，您需要以编程方式推进最后一个调用
返回了条目的 ID。大多数 Redis 客户端应该抽象此细节，但
如果需要，实现也可以在应用程序中。在上面的例子中，
这意味着增加序列`1526985685298-0`乘以 1，从 0 到 1。
因此，第二个呼吁将是：

    > XRANGE writers 1526985685298-1 + COUNT 2
    1) 1) 1526985691746-0
       2) 1) "name"
          2) "Toni"
    ...

另请注意，一旦最后一个ID的序列部分等于
18446744073709551615，您需要递增时间戳并重置
将部分序列到 0。例如，递增 ID
`1526985685298-18446744073709551615`应导致`1526985685299-0`.

对称模式适用于迭代流`XREVRANGE`.这
唯一的区别是客户端需要为后续的 ID 递减
调用。递减序列部分为 0 的 ID 时，时间戳需要
递减 1，序列设置为 18446744073709551615。

## 提取单个项目

如果你寻找一个`XGET`命令你会失望的，因为`XRANGE`
实际上是从中获取单个条目的方法
流。您所要做的就是在参数中指定 ID 两次
XRANGE：

    > XRANGE mystream 1526984818136-0 1526984818136-0
    1) 1) 1526984818136-0
       2) 1) "duration"
          2) "1532"
          3) "event-id"
          4) "5"
          5) "user-id"
          6) "7782813"

## 有关流的其他信息

有关 Redis 流的更多信息，请查看我们的
[Redis Streams 文档简介](/topics/streams-intro).

@return

@array回复，具体而言：

该命令返回 ID 与指定范围匹配的条目。
返回的条目已完成，这意味着 ID 和所有字段
它们组成被返回。此外，条目返回
它们的字段和值的顺序与`XADD`添加了它们。

@examples

```cli
XADD writers * name Virginia surname Woolf
XADD writers * name Jane surname Austen
XADD writers * name Toni surname Morrison
XADD writers * name Agatha surname Christie
XADD writers * name Ngozi surname Adichie
XLEN writers
XRANGE writers - + COUNT 2
```
